Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 256)       2304      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 256)       1024      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 128)       294912    
_________________________________________________________________
batch_normalization_1 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 64)          73728     
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 64)          256       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 32)          18432     
_________________________________________________________________
batch_normalization_3 (Batch (None, 4, 4, 32)          128       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 2, 2, 16)          4624      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 1, 1, 16)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 1, 1, 16)          2304      
_________________________________________________________________
batch_normalization_4 (Batch (None, 1, 1, 16)          64        
_________________________________________________________________
up_sampling2d (UpSampling2D) (None, 2, 2, 16)          0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 2, 2, 32)          4608      
_________________________________________________________________
batch_normalization_5 (Batch (None, 2, 2, 32)          128       
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 4, 4, 64)          18432     
_________________________________________________________________
batch_normalization_6 (Batch (None, 4, 4, 64)          256       
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 8, 128)         73728     
_________________________________________________________________
batch_normalization_7 (Batch (None, 8, 8, 128)         512       
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 16, 16, 256)       294912    
_________________________________________________________________
batch_normalization_8 (Batch (None, 16, 16, 256)       1024      
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 32, 1)         2305      
=================================================================
Total params: 794,193
Trainable params: 792,241
Non-trainable params: 1,952
_________________________________________________________________
