Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 100)]        0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 10)]         0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          51200       input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          5120        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 512)          2048        dense[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512)          2048        dense_1[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1024)         0           batch_normalization[0][0]        
                                                                 batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1568)         1605632     concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1568)         6272        dense_2[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 7, 7, 32)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 7, 7, 128)    36864       reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 7, 7, 128)    512         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 14, 14, 64)   73728       batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 14, 14, 64)   256         conv2d_transpose[0][0]           
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 28, 28, 1)    577         batch_normalization_4[0][0]      
==================================================================================================
Total params: 1,784,257
Trainable params: 1,778,689
Non-trainable params: 5,568
__________________________________________________________________________________________________
